In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import math
import warnings; warnings.simplefilter('ignore')
from code_files_feature_extraction import *

%matplotlib inline

In [2]:
arp_df = pd.read_csv('US_Accidents_June20.csv')

In [3]:
arp_df_ts = arp_df[['ID','Start_Time','City']]
arp_df_ts.head(7)

    ID           Start_Time          City
0  A-1  2016-02-08 05:46:00        Dayton
1  A-2  2016-02-08 06:07:59  Reynoldsburg
2  A-3  2016-02-08 06:49:27  Williamsburg
3  A-4  2016-02-08 07:23:34        Dayton
4  A-5  2016-02-08 07:39:07        Dayton
5  A-6  2016-02-08 07:44:26   Westerville
6  A-7  2016-02-08 07:59:35        Dayton

In [4]:
arp_df_ts.shape

(3513617, 3)

In [5]:
cities = ['Houston', 'Atlanta', 'LosAngeles', 'Charlotte', 'Dallas', 'Austin']
cities_df = arp_df_ts.loc[arp_df_ts['City'].isin(cities)].reset_index(drop=True)

In [6]:
cities_df.shape

(349997, 3)

In [7]:
#cities_df.head(18)

In [8]:
cities_dff = cities_df[['ID','Start_Time']]

In [10]:
cities_dff['Date'] = pd.DatetimeIndex(cities_dff['Start_Time']).to_period('D')
#cities_dff['Date'] = pd.DatetimeIndex(cities_dff['Start_Time']).to_period('M')
#cities_dff['Date'] = pd.DatetimeIndex(cities_dff['Start_Time']).to_period('W')
cities_dff.head(2)

         ID           Start_Time        Date
0  A-146263  2016-11-30 15:25:27  2016-11-30
1  A-146264  2016-11-30 14:42:27  2016-11-30

In [11]:
cities_dff.shape

(349997, 3)

In [12]:
cities_dff.drop(['Start_Time'],axis = 1, inplace=True)

In [13]:
cities_dff.isnull().sum()

ID      0
Date    0
dtype: int64

In [14]:
cities_dff.head(2)

         ID        Date
0  A-146263  2016-11-30
1  A-146264  2016-11-30

In [15]:
# arp_df_Day = arp_df_ts.groupby('Date')['ID'].count().reset_index()
# arp_df_Day.head(2)

In [16]:
cities_dff_arp = cities_dff.groupby('Date')['ID'].count().reset_index()
cities_dff_arp.head(2)

         Date  ID
0  2016-04-02   2
1  2016-05-04   1

In [15]:
cities_dff_arp.rename(columns={'ID':'Accidents'}, inplace=True)
cities_dff_arp.head(10)

      Date  Accidents
0  2016-04          2
1  2016-05          1
2  2016-06       2349
3  2016-07       5965
4  2016-08       7289
5  2016-09       7522
6  2016-10       7858
7  2016-11       9504
8  2016-12       8240
9  2017-01       8522

In [17]:
cities_dff_arp.shape

(1472, 2)

In [18]:
cities_dff_arp.to_csv(r'arp_DailyAccidents_sixCities_daily.csv',index=False)